
# Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

nums = [12, 85, 79, 12, 75, 22, 79, 43, 44, 85, 93, 10]
unique_numbers = list(set(nums))
print(unique_numbers)